---
kind: method
id: M:Autodesk.Revit.DB.FamilyParameterSet.Clear
source: html/61a82661-d5f4-5712-faf9-79d969ce6e68.htm
---
# Autodesk.Revit.DB.FamilyParameterSet.Clear Method

Removes every item from the set, rendering it empty.

## Syntax (C#)
```csharp
public virtual void Clear()
```